let a1 = localStorage.getItem('a1')
let a2 = localStorage.getItem('a2')
let a3 = localStorage.getItem('a3')
let a4 = localStorage.getItem('a4')
let a5 = localStorage.getItem('a5')
let count = 0
let section1 = document.querySelector("#section1")

/* 원본

if((a1 === '남자' || '여자') && (a2 === 'm170' || 'm170179' || 'm180' || 'w160' || 'w160169' || 'w170') && (a3 === '높은베개' || '적당히높은베개' || '적당히낮은베개' || '낮은베개') && (a4 === '딱딱한베개' || '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함' || '푹신한 베개') && (a5 === '강력한목지지' || '적당하거나약간강함' || '적당하거나약간약함')) {
    console.log('ew')
}

*/

if((a1 === '남자') && (a2 === 'm170' || 'm170179' || 'm180') && (a3 === '높은베개' || '적당히높은베개') && (a4 === '딱딱한베개' || '적당히딱딱하거나탄탄함') && (a5 === '강력한목지지' || '적당하거나약간강함')) {
    console.log('우유베개 스탠다드핏')
    count++
    section1.textContent = section1.textContent + ' 우유베개 스탠다드핏'
}
if((a1 === '여자') && (a2 === 'w160169' || 'w170') && (a3 === '높은베개' || '적당히높은베개') && (a4 === '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함') && (a5 === '강력한목지지' || '적당하거나약간강함')) {
    console.log('우유베개 이지핏')
    count++
    section1.textContent = section1.textContent + ' 우유베개 이지핏'
}
if((a1 === '남자' || '여자') && (a2 === 'm170' || 'm170179' || 'm180' || 'w160' || 'w160169' || 'w170') && (a3 === '높은베개' || '적당히높은베개') && (a4 === '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함') && (a5 === '적당하거나약간강함' || '적당하거나약간약함')) {
    console.log('우유베개 플러스')
    count++
    section1.textContent = section1.textContent + ' 우유베개 플러스'
}
if((a1 === '남자' || '여자') && (a2 === 'm170' || 'w160' || 'w160169' || 'w170') && (a3 === '적당히낮은베개' || '낮은베개') && (a4 === '딱딱한베개' || '적당히딱딱하거나탄탄함') && (a5 === '강력한목지지')) {
    console.log('솔래빗 알파베개')
    count++
    section1.textContent = section1.textContent + ' 솔래빗 알파베개'
}
if((a1 === '남자' || '여자') && (a2 === 'm170' || 'm170179' || 'w160' || 'w160169' || 'w170') && (a3 === '높은베개' || '적당히높은베개' || '적당히낮은베개') && (a4 === '적당히부드럽거나푹신함' || '푹신한 베개') && (a5 === '적당하거나약간강함' || '적당하거나약간약함')) {
    console.log('센스맘 숨쉬는베개')
    count++
    section1.textContent = section1.textContent + ' 센스맘 숨쉬는베개'
}
if((a1 === '남자' || '여자') && (a2 === 'm170' || 'm170179' || 'm180' || 'w160' || 'w160169' || 'w170') && (a3 === '높은베개' || '적당히높은베개') && (a4 === '딱딱한베개' || '적당히딱딱하거나탄탄함') && (a5 === '강력한목지지' || '적당하거나약간강함')) {
    console.log('노르딕슬립 미디엄로우')
    count++
    section1.textContent = section1.textContent + ' 노르딕슬립 미디엄로우'
}
if((a1 === '남자' || '여자') && (a2 === 'm170' || 'm170179' || 'w160' || 'w160169' || 'w170') && (a3 === '적당히높은베개' || '적당히낮은베개') && (a4 === '딱딱한베개' || '적당히딱딱하거나탄탄함') && (a5 === '강력한목지지' || '적당하거나약간강함')) {
    console.log('씨가드 닥터필로')
    count++
    section1.textContent = section1.textContent + ' 씨가드 닥터필로'
}
if((a1 === '남자' || '여자') && (a2 === 'm170' || 'm170179' || 'w160' || 'w160169' || 'w170') && (a3 === '적당히높은베개' || '적당히낮은베개' || '낮은베개') && (a4 === '딱딱한베개' || '적당히딱딱하거나탄탄함') && (a5 === '강력한목지지' || '적당하거나약간강함')) {
    console.log('몽제 에어네트')
    count++
    section1.textContent = section1.textContent + ' 몽제 에어네트'
}
if((a1 === '남자') && (a2 === 'm170' || 'm170179' || 'w160' || 'w160169' || 'w170') && (a3 === '적당히높은베개' || '적당히낮은베개' || '낮은베개') && (a4 === '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함') && (a5 === '적당하거나약간강함' || '적당하거나약간약함')) {
    console.log('몽제 에르고')
    count++
    section1.textContent = section1.textContent + ' 몽제 에르고'
}
if((a1 === '남자' || '여자') && (a2 === 'm170' || 'm170179' || 'w160' || 'w160169') && (a3 === '적당히높은베개' || '적당히낮은베개') && (a4 === '적당히부드럽거나푹신함' || '푹신한 베개') && (a5 === '적당하거나약간강함' || '적당하거나약간약함')) {
    console.log('홍성돈 숙면베개')
    count++
    section1.textContent = section1.textContent + ' 홍성돈 숙면베개'
}
if((a1 === '여자') && (a2 === 'w160' || 'w160169') && (a3 === '적당히낮은베개' || '낮은베개') && (a4 === '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함' || '푹신한 베개') && (a5 === '적당하거나약간강함' || '적당하거나약간약함')) {
    console.log('템퍼 오리지널 XS')
    count++
    section1.textContent = section1.textContent + ' 템퍼 오리지널 XS'
}
if((a1 === '남자' || '여자') && (a2 === 'm170' || 'm170179' || 'w160' || 'w160169' || 'w170') && (a3 === '적당히낮은베개' || '낮은베개') && (a4 === '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함' || '푹신한 베개') && (a5 === '강력한목지지' || '적당하거나약간강함')) {
    console.log('템퍼 오리지널 S')
    count++
    section1.textContent = section1.textContent + ' 템퍼 오리지널 S'
}
if((a1 === '남자') && (a2 === 'm170179' || 'm180') && (a3 === '높은베개' || '적당히높은베개' || '적당히낮은베개') && (a4 === '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함' || '푹신한 베개') && (a5 === '적당하거나약간강함' || '적당하거나약간약함')) {
    console.log('템퍼 오리지널 M')
    count++
    section1.textContent = section1.textContent + ' 템퍼 오리지널 M'
}
if((a1 === '남자' || '여자') && (a2 === 'm170179' || 'm180' || 'w160169' || 'w170') && (a3 === '적당히높은베개' || '적당히낮은베개' || '낮은베개') && (a4 === '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함' || '푹신한 베개') && (a5 === '강력한목지지' || '적당하거나약간강함' || '적당하거나약간약함')) {
    console.log('템퍼 밀레니엄 XS')
    count++
    section1.textContent = section1.textContent + ' 템퍼 밀레니엄 XS'
}
if((a1 === '남자' || '여자') && (a2 === 'm170179' || 'm180' || 'w170') && (a3 === '높은베개' || '적당히높은베개' || '적당히낮은베개') && (a4 === '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함' || '푹신한 베개') && (a5 === '강력한목지지' || '적당하거나약간강함' || '적당하거나약간약함')) {
    console.log('템퍼 밀리니엄 S')
    count++
    section1.textContent = section1.textContent + ' 템퍼 밀리니엄 S'
}
if((a1 === '남자') && (a2 === 'm170179' || 'm180') && (a3 === '높은베개' || '적당히높은베개') && (a4 === '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함' || '푹신한 베개') && (a5 === '강력한목지지' || '적당하거나약간강함' || '적당하거나약간약함')) {
    console.log('템퍼 밀리니엄 M')
    count++
    section1.textContent = section1.textContent + ' 템퍼 밀리니엄 M'
}
if((a1 === '남자' || '여자') && (a2 === 'm170' || 'm170179' || 'm180' || 'w160' || 'w160169' || 'w170') && (a3 === '적당히높은베개' || '적당히낮은베개') && (a4 === '적당히딱딱하거나탄탄함' || '적당히부드럽거나푹신함') && (a5 === '강력한목지지' || '적당하거나약간강함')) {
    console.log('가누다 블루라벨 피아노')
    count++
    section1.textContent = section1.textContent + ' 가누다 블루라벨 피아노'
}
if(count === 0) {
    console.log('해당없음')
}